def dfs(graph, v, visited):
    visited[v] = True
    print(v, end=' ')
    #현재 노드와 연결된 다른 노드를
    #재귀적으로 방문
    for i in graph[v]:
        if not visited[i]:
            dfs(graph, i, visited)
if __name__ == "__main__":
    # 각 노드가 연결된 정보를 리스트 자료형으로 표현(2차원 리스트)
    graph = [
        [],
        [2, 3, 8],
        [1, 7],
        [1, 4, 5],
        [3, 5],
        [3, 4],
        [7],
        [2, 6, 8],
        [1, 7]
    ]
    # 각 노드가 방문된 정보를 리스트 자료형으로 표현(1차원 리스트) 이미 간 곳은 다시 가면 무한 루프가 되기에
    # 초기값은 모두 False로 초기화
    visited = [False] * 9
    # 1번 노드부터 시작
    dfs(graph, 1, visited)
    # 출력: 1 2 7 6 8 3 4 5
    # 1번 노드부터 시작하여 깊이 우선 탐색을 하면 2, 3, 8, 7, 6, 4, 5 순서로 방문하게 된다.
    # 2번 노드부터 시작하여 깊이 우선 탐색을 하면 1, 7, 6, 8, 3, 4, 5 순서로 방문하게 된다.
    # 3번 노드부터 시작하여 깊이 우선 탐색을 하면 1, 2, 7, 8, 6, 4, 5 순서로 방문하게 된다.
    # 4번 노드부터 시작하여 깊이 우선 탐색을 하면 1, 2, 3, 5, 4, 8, 6 순서로 방문하게 된다.
    # 5번 노드부터 시작하여 깊이 우선 탐색을 하면 1, 2, 3, 4, 8, 6 순서로 방문하게 된다.
    # 6번 노드부터 시작하여 깊이 우선 탐색을 하면 1, 2, 3, 4, 8, 7 순서로 방문하게 된다.
    # 7번 노드부터 시작하여 깊이 우선 탐색을 하면 1, 2, 3, 4, 8, 6 순서로 방문하게 된다.
    # 8번 노드부터 시작하여 깊이 우선 탐색을 하면 1, 2, 3, 4, 5, 6, 7 순서로 방문하게 된다.
